# CrossSectionRotation Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..CrossSectionRotation Property
AnalyticalMember Class See Also
---
This represents the cross-section rotation, in radians.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double CrossSectionRotation { get; set; }
```

Visual Basic
---
```text
Public Property CrossSectionRotation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CrossSectionRotation {
	double get ();
	void set (double value);
}
```

# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace